<?php
/**
 * Copyright © 2026 Alliance Dgtl. https://alb.ua/uk
 */

// General Text
$_['text_alliance_settings']    = 'Налаштування модуля оплати alliance';
$_['text_help_settings']        = 'Обов\'язково пропишіть всі налаштування і провірте чи все правильно прописано та налаштовано. В іншому випадку, оплата може працювати не коректно.';
$_['text_help_jwt']             = 'Пропишіть ключи jwt. Потрібно з згенерованого файлу ключа вибрати параметри "x", "y", "d" для дешифрування відповідей. Якщо ключи не будуть прописані або будуть не вірні, тоді плагін не буде працювати. В разі винекнення питань, зверніться до АТ "БАНК АЛЬЯНС".';
$_['text_payment_info']         = 'Інформація про платіж';
$_['text_message_type']         = 'Тип повідомлення:';
$_['text_refund_status']        = 'Статус повернення:';
$_['text_refund_successful']    = 'повернення коштів здійснено';
$_['text_order_status']         = 'Статус замовлення:';
$_['text_amount']               = 'Сума:';
$_['text_ecom_order_id']        = 'ID замовлення Ecom:';
$_['text_status_url']           = 'URL статусу:';
$_['text_merchant_id']          = 'ID мерчанта:';
$_['text_hpp_order_id']         = 'ID замовлення HPP:';
$_['text_hpp_pay_type']         = 'Тип оплати HPP:';
$_['text_expired_order_date']   = 'Термін дії замовлення:';
$_['text_created_date']         = 'Дата створення:';

// Entries
$_['entry_api_url']             = 'URL-адреса API Alliance';
$_['entry_param_x']             = 'Параметр "x"';
$_['entry_param_y']             = 'Параметр "y"';
$_['entry_param_d']             = 'Параметр "d"';
$_['entry_fail_url']            = 'Сторінка на яку перенаправиться користувач в разі помилки оплати';
$_['entry_success_url']         = 'Сторінка на яку перенаправиться користувач в разі успішної оплати';
$_['entry_status']              = 'Статус модуля оплати';
$_['entry_pending_status']      = 'Статус "в процесі оплати"';
$_['entry_error_status']        = 'Статус "помилка оплати"';
$_['entry_paid_status']         = 'Статус "оплачено"';
$_['entry_refunded_status']     = 'Статус "оплату повернено"';
$_['entry_refund_fail_status']  = 'Статус "помилка повернення оплати"';

// Helps
$_['help_service_code']         = 'Отримайте serviceCode в АТ "БАНК АЛЬЯНС"';
$_['help_merchant_id']          = 'Отримайте merchantId в АТ "БАНК АЛЬЯНС"';
$_['help_fail_url']             = 'Ця сторінка стандартна за налаштуваннями вашого магазину, якщо є сторінка на яку ви хочете перенаправляти покупця будь ласка вкажіть її. Обов\'язково потрібно прописати повний шлях. Приклад - https://example.com/fail';
$_['help_success_url']          = 'Ця сторінка стандартна за налаштуваннями вашого магазину, якщо є сторінка на яку ви хочете перенаправляти покупця будь ласка вкажіть її. Обов\'язково потрібно прописати повний шлях. Приклад - https://example.com/success';
$_['help_status']               = 'Виберіть \'Enabled\', щоб активувати модуль';
$_['help_statuses']             = 'Статуси обов\'язково потрібно налаштувати і правильно. Так як вони будуть використувавати в процесі оплати.';
$_['help_pending_status']       = 'Виберіть тут статус, який відповідає даному статусу в вашому магазині. Наприклад статус - "Pending"';
$_['help_error_status']         = 'Виберіть тут статус, який відповідає даному статусу в вашому магазині. Наприклад статус - "Failed"';
$_['help_paid_status']          = 'Виберіть тут статус, який відповідає даному статусу в вашому магазині. Наприклад статус - "Complete"';
$_['help_refunded_status']      = 'Виберіть тут статус, який відповідає даному статусу в вашому магазині. Наприклад статус - "Refunded"';
$_['help_refund_fail_status']   = 'Виберіть тут статус, який відповідає даному статусу в вашому магазині. Наприклад статус - "Failed"';

$_['text_statuses']                 = 'Статуси замовлень';
$_['text_refund_history_comment']   = 'Повернення коштів через Alliance Payment';
$_['text_refund_success_message']   = 'Повернення коштів здійснено';
$_['text_auto_return_comment']      = 'Автоматичне повернення через систему AlliancePay';
$_['error_something_went_wrong']    = 'Щось пішло не так :(';

$_['text_partial_refund_title'] = 'Створити повернення для обраних товарів';
$_['button_partial_refund']     = '<i class="fa fa-reply"></i> Часткове повернення';
$_['button_full_refund']        = '<i class="fa fa-undo"></i> Повне повернення коштів';
$_['text_refund_complete_js']   = 'Повернення завершено!';
$_['text_refund_failed_js']     = 'Помилка повернення!';
$_['button_check_status']       = '<i class="fa fa-info"></i> Перевірити статус замовлення';
$_['heading_title_order_data']  = 'Отримання даних по замовленню';
$_['text_technical_error']      = 'Сталась технічна помилка';
$_['text_shipping_match']       = 'доставка'; // Слово для пошуку в базі

$_['text_select_for_return']         = 'Обрати для повернення';
$_['text_already_returned']          = 'Вже повернуто';
$_['text_order_fully_refunded']      = 'Сума замовлення повністю повернута.';
$_['text_refund_shipping_cost']      = 'Повернути вартість доставки?';
$_['text_please_select_products']    = 'Будь ласка, оберіть товари!';
$_['text_confirm_return_requests']   = 'Створити запити на повернення для обраних товарів?';